GadgetOnOff Project/src/DataProcessors/УдалениеВалют/УдалениеВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УдалениеВалют</name>
</mdclass:DataProcessor>

GadgetOnOff Project/src/Documents/УстановкаКурсовВалют/УстановкаКурсовВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаКурсовВалют</name>
  <registerRecords>InformationRegister.КурсыВалют</registerRecords>
  <tabularSections>
    <name>Валюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GadgetOnOff Project/src/DataProcessors/УдалениеВалют/Forms/Форма/Module.bsl
&НаСервере
Процедура УдалениеВалютНаСервере()
	
	//Находим все валюты
	ВыборкаВалюты = Справочники.Валюты.Выбрать();
	//Обходим все элементы
	Пока ВыборкаВалюты.Следующий() Цикл
		//1-ый вариант. Получаем объект для редактирования 1-ый вариант
		Валюта = ВыборкаВалюты.Ссылка.ПолучитьОбъект();
		//Условие
		Если Валюта.Предопределенный = Ложь Тогда
			Валюта.Удалить();
			//2-ой вариант. Получаем объект для редактирования и удлаяем
			//ВыборкаВалюты.ПолучитьОбъект().Удалить();
			Сообщить("Валюта удалена " + ВыборкаВалюты.Наименование);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеВалют(Команда)
	
	УдалениеВалютНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалениеВалютИзДокументаНаСервере()
	
	УдалениеВалютИзДокументаНаСервереФрагмент();


КонецПроцедуры

&НаСервере
Процедура УдалениеВалютИзДокументаНаСервереФрагмент()
	
	//Делаем запрос для выбора и возврашает резльтат запроса 
	Выборка = Документы.УстановкаКурсовВалют.Выбрать();
	//Получение документка и из выборки и обход этого документа
	Пока Выборка.Следующий() Цикл
		//Получаем количество элементов в коллекции
		КоличествоСтрок = Выборка.Валюты.Количество();
		//Если количество строк больше 2, то выполняется цикл
		Если КоличествоСтрок > 2 Тогда
			//Получаем объект для работы над ним
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Индекс = 0;
			Пока Индекс < КоличествоСтрок Цикл
				Строка = Документ.Валюты[Индекс];
				Если Строка.Валюта.Предопределенный = Ложь Тогда
					Документ.Валюты.Удалить(Индекс);
					КоличествоСтрок = КоличествоСтрок - 1;	
				Иначе
					Индекс = Индекс + 1	
				КонецЕсли;
			КонецЦикла;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			//	//Если количество строк не больше двух	
			//Иначе
			//	//Переходим на следующий этап цикла
			//	Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	
	//Перем Валюта, ВсеВалюты, ВыборкаДетальныеЗаписи, Документ, Запрос, РезультатЗапроса;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	УстановкаКурсовВалютВалюты.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.УстановкаКурсовВалют.Валюты КАК УстановкаКурсовВалютВалюты
	//|ГДЕ
	//|	УстановкаКурсовВалютВалюты.Валюта.Предопределенный = ЛОЖЬ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УстановкаКурсовВалютВалюты.Ссылка";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	////Проверка количества строк в запросе
	//Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
	//	
	//	Сообщить("Нет документов");
	//Иначе
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//					
	//		//Получение документа по ссылке
	//		Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//		//Документ.Записать(РежимЗаписиДокумента.Проведение);
	//		Сообщить("Удаление документа " + ВыборкаДетальныеЗаписи.Ссылка);
	//		Документ.Удалить();
	//		
	//	КонецЦикла;
	//КонецЕсли;
	//
	//Находим все валюты
	//ВсеВалюты = Справочники.Валюты.Выбрать();
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	Валюты.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.Валюты КАК Валюты
	//|ГДЕ
	//|	Валюты.Предопределенный = Ложь";
	//
	////Выбраем все непредопределенные валюты
	//ВсеВалюты = Запрос.Выполнить().Выбрать();	
	//Если ВсеВалюты.Количество() = 0 Тогда
	//	Сообщить("Нет непредопределенных валют")	
	//Иначе	
	//	//Обходим все элементы
	//	Пока ВсеВалюты.Следующий() Цикл	
	//		Валюта = ВсеВалюты.Ссылка.ПолучитьОбъект();
	//		//Условие
	//		//Если Валюта.Предопределенный = Ложь Тогда
	//		Сообщить("Удаление валюты " + ВсеВалюты.Ссылка);
	//		Валюта.Удалить();
	//		//КонецЕсли;	
	//	КонецЦикла;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалениеВалютИзДокумента(Команда)
	
	УдалениеВалютИзДокументаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалениеДокументовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаКурсовВалютВалюты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаКурсовВалют.Валюты КАК УстановкаКурсовВалютВалюты
	|ГДЕ
	|	УстановкаКурсовВалютВалюты.Валюта.Предопределенный = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	УстановкаКурсовВалютВалюты.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Проверка количества строк в запросе
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		Сообщить("Нет документов");
	Иначе
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			//Получение документа по ссылке
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			//Документ.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Удаление документа " + ВыборкаДетальныеЗаписи.Ссылка);
			Документ.Удалить();
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеДокументов(Команда)
	
	УдалениеДокументовНаСервере();
	
КонецПроцедуры
